#* - coding: utf-8 -*-

# 原始表达数据第一行为样本名称，第一列为基因名称，其余为表达量，如下所示：
#     geneid  sample1 sample2 sample3
#     gene1   2   3   4
#     gene2   4   5   6
#     gene3   7   8   9
# 分组数据如下：
# sample1 group1
# sample2 group2
# sample3 group1
# sample4 group3
# sample5 group2

PCA_plot <- function(gene, group, plot_title) {
    # 如果不存在tidyverse/FactoMineR/factoextra/ggrepel/ggplot2包，则下载
    if (!require(tidyverse)) {
        install.packages("tidyverse")
    }
    if (!require(FactoMineR)) {
        install.packages("FactoMineR")
    }
    if (!require(factoextra)) {
        install.packages("factoextra")
    }
    if (!require(ggrepel)) {
        install.packages("ggrepel")
    }
    if (!require(ggplot2)) {
        install.packages("ggplot2")
    }
    # 载入包
    library(tidyverse)
    library(FactoMineR)
    library(factoextra)
    library(ggrepel)
    # 我们使用 FactoMineR 包中的方法，实现 PCA 分析和聚类添加
    ### 样本中基因表达值的 PCA 分析
    gene.pca <- PCA(gene, ncp = 2, scale.unit = TRUE, graph = FALSE)
    #   plot(gene.pca)  #PCA 简图
    ### 提取样本在 PCA 前两轴中的坐标
    pca_sample <- data.frame(gene.pca$ind$coord[, 1:2])
    #   head(pca_sample)
    ### 提取 PCA 前两轴的贡献度
    pca_eig1 <- round(gene.pca$eig[1, 2], 2)
    pca_eig2 <- round(gene.pca$eig[2, 2], 2)
    # 合并样本分组信息
    group <- group[rownames(pca_sample), ]
    pca_sample <- cbind(pca_sample, group)
    pca_sample$samples <- rownames(pca_sample)
    #   head(pca_sample)  #作图数据中包含了样本坐标和分组信息 # nolint
    # ggplot2 绘制二维散点图
    p <- ggplot(data = pca_sample, aes(x = Dim.1, y = Dim.2)) +
        geom_point(aes(color = group), size = 3) + # 根据样本坐标绘制二维散点图
        scale_color_manual(values = c(
            "#F8766D", "#C49A00", "#53B400", "#00B6EB",
            "#A58AFF", "#FB61D7", "#FF9900", "#FF33CC",
            "#6666FF", "#b605eb", "#0a59d9", "#05cfa7",
            "#b8e906", "#e99e07", "#2ffb0b", "#710aef",
            "purple", "brown", "orange"
        )) + # 自定义颜色
        # scale_color_brewer(values = "Set1") +

        theme(
            panel.grid = element_blank(),
            panel.background = element_rect(
                color = "black",
                fill = "transparent"
            ),
            legend.key = element_rect(fill = "transparent")
        ) + # 去除背景和网格线
        labs(
            x = paste("PCA1:", pca_eig1, "%"),
            y = paste("PCA2:", pca_eig2, "%"), color = ""
        ) # 将 PCA 轴贡献度添加到坐标轴标题中


    # 标识样本名称，使用 ggplot2 的拓展包 ggrepel 来完成
    p <- p +
        geom_text_repel(aes(label = samples),
            size = 3, show.legend = FALSE,
            box.padding = unit(0.5, "lines"),
            # max.overlaps = In # 可设置标签不重叠
        )
    # 添加置信椭圆
    # p <- p + stat_ellipse(aes(color = group), geom = "polygon", alpha = 0.2, linetype = 2, linewidth = 1, level = 0.95)
    # 添加图片标题
    p <- p + ggtitle(plot_title)
    return(p)
}



# 读入原始表达数据
gene_data <- read.csv("D:\\000zyf\\work\\01cfRNA\\01hill\\statistic\\samples_CPM_clean.csv", header = T, sep = ",", row.names = 1)
# 读入分组信息
group <- read.csv("D:\\000zyf\\work\\01cfRNA\\01hill\\statistic\\group\\sample_experiment_date.csv", header = T, sep = ",", row.names = 1)
# 设置图片标题
plot_title <- "hill_cpm_experiment_date"
# 删除表达量为0的行
gene_data <- gene_data[apply(gene_data, 1, function(x) sum(x == 0) != ncol(gene_data)), ]
# 转置
gene_data <- t(gene_data)
# 进行log转化
gene_data <- log2(gene_data + 1)
p <- PCA_plot(gene_data, group, plot_title)
p
# 保存为png格式
ggsave("hill_cpm_experiment_date.png", plot = p, width = 8, height = 8)











# /*
#  * ......................................&&.........................
#  * ....................................&&&..........................
#  * .................................&&&&............................
#  * ...............................&&&&..............................
#  * .............................&&&&&&..............................
#  * ...........................&&&&&&....&&&..&&&&&&&&&&&&&&&........
#  * ..................&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&..............
#  * ................&...&&&&&&&&&&&&&&&&&&&&&&&&&&&&.................
#  * .......................&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&.........
#  * ...................&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&...............
#  * ..................&&&   &&&&&&&&&&&&&&&&&&&&&&&&&&&&&............
#  * ...............&&&&&@  &&&&&&&&&&..&&&&&&&&&&&&&&&&&&&...........
#  * ..............&&&&&&&&&&&&&&&.&&....&&&&&&&&&&&&&..&&&&&.........
#  * ..........&&&&&&&&&&&&&&&&&&...&.....&&&&&&&&&&&&&...&&&&........
#  * ........&&&&&&&&&&&&&&&&&&&.........&&&&&&&&&&&&&&&....&&&.......
#  * .......&&&&&&&&.....................&&&&&&&&&&&&&&&&.....&&......
#  * ........&&&&&.....................&&&&&&&&&&&&&&&&&&.............
#  * ..........&...................&&&&&&&&&&&&&&&&&&&&&&&............
#  * ................&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&............
#  * ..................&&&&&&&&&&&&&&&&&&&&&&&&&&&&..&&&&&............
#  * ..............&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&....&&&&&............
#  * ...........&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&......&&&&............
#  * .........&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&.........&&&&............
#  * .......&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&...........&&&&............
#  * ......&&&&&&&&&&&&&&&&&&&...&&&&&&...............&&&.............
#  * .....&&&&&&&&&&&&&&&&............................&&..............
#  * ....&&&&&&&&&&&&&&&.................&&...........................
#  * ...&&&&&&&&&&&&&&&.....................&&&&......................
#  * ...&&&&&&&&&&.&&&........................&&&&&...................
#  * ..&&&&&&&&&&&..&&..........................&&&&&&&...............
#  * ..&&&&&&&&&&&&...&............&&&.....&&&&...&&&&&&&.............
#  * ..&&&&&&&&&&&&&.................&&&.....&&&&&&&&&&&&&&...........
#  * ..&&&&&&&&&&&&&&&&..............&&&&&&&&&&&&&&&&&&&&&&&&.........
#  * ..&&.&&&&&&&&&&&&&&&&&.........&&&&&&&&&&&&&&&&&&&&&&&&&&&.......
#  * ...&&..&&&&&&&&&&&&.........&&&&&&&&&&&&&&&&...&&&&&&&&&&&&......
#  * ....&..&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&...........&&&&&&&&.....
#  * .......&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&..............&&&&&&&....
#  * .......&&&&&.&&&&&&&&&&&&&&&&&&..&&&&&&&&...&..........&&&&&&....
#  * ........&&&.....&&&&&&&&&&&&&.....&&&&&&&&&&...........&..&&&&...
#  * .......&&&........&&&.&&&&&&&&&.....&&&&&.................&&&&...
#  * .......&&&...............&&&&&&&.......&&&&&&&&............&&&...
#  * ........&&...................&&&&&&.........................&&&..
#  * .........&.....................&&&&........................&&....
#  * ...............................&&&.......................&&......
#  * ................................&&......................&&.......
#  * .................................&&..............................
#  * ..................................&..............................
#  */
